# Preprocesamiento de Datos con Python
## FES Aragon
### ICO
#### Avenda√±o Villegas Brandon

In [2]:
import pandas as pd
import numpy as np

In [3]:
#Series
s = pd.Series({'a': 10, 'b': 20, 'c': 30})
print (type(s))
s

<class 'pandas.core.series.Series'>

a    10
b    20
c    30
dtype: int64

In [6]:
s1 = pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [7]:
# Serie que empieza en 0 y termina en 4
s1.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
s1.max()

40

In [10]:
s1.describe()

count     4.000000
mean     25.000000
std      12.909944
min      10.000000
25%      17.500000
50%      25.000000
75%      32.500000
max      40.000000
dtype: float64

In [12]:
# Generamos una serue de numeros aleatorios
s2 = pd.Series(np.random.randn(5))
s2

0    0.806903
1   -0.879124
2   -0.227638
3   -1.355641
4   -2.151873
dtype: float64

In [13]:
# Un onjbeto con vatios objetos
s3 = pd.Series([[10, 20],\
                [30, 40.5,'series'],\
                [50, 55],\
                {'Name':'Tess','Org':'Packt'}])

In [16]:
# Obtener elemento de una serie
s3[1]
# Obtener elemento de una lista
s3[1][1]

40.5

In [18]:
# No optenemos valores esta disticos porque todos son objetos
s3.describe()

count            4
unique           4
top       [10, 20]
freq             1
dtype: object

$$ DATA-FRAME $$

In [21]:
# Forma que tendra nuestro objeto, el 4 representa las filas, luego las columnas.
# En este caso solo tenemos un dato porque se tratan de objetos
s3.shape

(4,)

In [25]:
#DataFrame
df = pd.DataFrame([30,50,20])
print(type(df))
print(df.shape)
# Tres filas y una columna

<class 'pandas.core.frame.DataFrame'>
(3, 1)

In [26]:
df

    0
0  30
1  50
2  20

In [28]:
# Obtener los indices de nuestas columnas
df.columns

RangeIndex(start=0, stop=1, step=1)

In [30]:
#Obtener todsoa loa indices de nuesta fila
df.index

RangeIndex(start=0, stop=3, step=1)

In [32]:
#Recuperar los indices
list(df.index)

[0, 1, 2]

In [34]:
print("Columnas del DataFrame: ", list(df.columns))
print("Los indices de nuestros rengoles del DataFrame: ", list(df.index))

Columnas del DataFrame:  [0]
Los indices de nuestros rengoles del DataFrame:  [0, 1, 2]

In [37]:
# Remplazamos nombres de las filas y columnas
df.columns=["C1"]
df.index=["R1","R2","R3"]
df

    C1
R1  30
R2  50
R3  20

In [39]:
df["C1"]

R1    30
R2    50
R3    20
Name: C1, dtype: int64

In [41]:
l = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df1 = pd.DataFrame(data=l)
print(df1.shape)
df1

(4, 3)

   0  1  2
0  0  1  2
1  1  2  3
2  4  5  6
3  7  8  9

In [44]:
l = [(0, 1, 2), (1, 2, 3), (4, 5, 6), (7, 8, 9)]
df1 = pd.DataFrame(data=l,
                   columns=["C1","C2","C3"],
                   index=["R1","R2","R3","R4"])

df1

    C1  C2  C3
R1   0   1   2
R2   1   2   3
R3   4   5   6
R4   7   8   9

In [45]:
df1.describe()

             C1        C2        C3
count  4.000000  4.000000  4.000000
mean   3.000000  4.000000  5.000000
std    3.162278  3.162278  3.162278
min    0.000000  1.000000  2.000000
25%    0.750000  1.750000  2.750000
50%    2.500000  3.500000  4.500000
75%    4.750000  5.750000  6.750000
max    7.000000  8.000000  9.000000

In [50]:
# No tienen que ser del mismo tipo de datos los elementos denteo del diccionario
d = {'py101':[10, 5, 33 ,45, 25, 22], 
                'py111':[0, 15, 21 , 30, 31, 11], 
                'py121':[15, 5, 1 ,10, 42, 21], 
                'py301':(20, 35, 3 ,15, 0, 0), }
meses = ('enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio')
# Ya no viene de una lista si no de un diccionario
df4=pd.DataFrame(data=d, index=meses)
df4

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

In [55]:
# Arrange nos genera numeros en un rango
#Generar numeros con estructura de matriz 3x3 para casos de prueba, esto se puede moldear a cualquier caso
m= np.arange(9).reshape(3,3)
m

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [57]:
df5=pd.DataFrame(m,index=["uno", "dos", "tres"], columns=["C1",2,"C3"])
df5

      C1  2  C3
uno    0  1   2
dos    3  4   5
tres   6  7   8

In [59]:
# Trata el 2 como numero y no como cadena
df5.columns

Index(['C1', 2, 'C3'], dtype='object')

In [60]:
d

{'py101': [10, 5, 33, 45, 25, 22],
 'py111': [0, 15, 21, 30, 31, 11],
 'py121': [15, 5, 1, 10, 42, 21],
 'py301': (20, 35, 3, 15, 0, 0)}

In [63]:
# sf6 si tiene datos, pero no existen columnas que se llamen mesas, sillas, bancos, puertas
df6 = pd.DataFrame(data=d, index=meses, columns=['mesas', 'py101', 'bancos', 'puertas'])
df6

        mesas  py101 bancos puertas
enero     NaN     10    NaN     NaN
febrero   NaN      5    NaN     NaN
marzo     NaN     33    NaN     NaN
abril     NaN     45    NaN     NaN
mayo      NaN     25    NaN     NaN
junio     NaN     22    NaN     NaN

In [65]:
df7= pd.DataFrame(data=d, index=meses)
df7

         py101  py111  py121  py301
enero       10      0     15     20
febrero      5     15      5     35
marzo       33     21      1      3
abril       45     30     10     15
mayo        25     31     42      0
junio       22     11     21      0

In [67]:
df7.columns=['BD', 'TEBO', 'UML', 'JAVA']
df7

         BD  TEBO  UML  JAVA
enero    10     0   15    20
febrero   5    15    5    35
marzo    33    21    1     3
abril    45    30   10    15
mayo     25    31   42     0
junio    22    11   21     0

In [68]:
# Renombrar 
df7.rename(columns={'BD': 'SI', 'JAVA':'POO'}, inplace=True)
df7

         SI  TEBO  UML  POO
enero    10     0   15   20
febrero   5    15    5   35
marzo    33    21    1    3
abril    45    30   10   15
mayo     25    31   42    0
junio    22    11   21    0

In [70]:
#Cambiar el nombre de algunos indices del DF
df7.rename(index={'feb':'febrero', 'may':'mayo'}, inplace=True)
df7

         SI  TEBO  UML  POO
enero    10     0   15   20
febrero   5    15    5   35
marzo    33    21    1    3
abril    45    30   10   15
mayo     25    31   42    0
junio    22    11   21    0

In [72]:
#Cambiar el nombre de algunos indices y columnas del DF
df7.rename(index={'febrero':'feb', 'mayo':'may'}, columns={'SI':'PROG1'}, inplace=True)
df7

       PROG1  TEBO  UML  POO
enero     10     0   15   20
feb        5    15    5   35
marzo     33    21    1    3
abril     45    30   10   15
may       25    31   42    0
junio     22    11   21    0

In [73]:
df7.describe()

           PROG1       TEBO        UML        POO
count   6.000000   6.000000   6.000000   6.000000
mean   23.333333  18.000000  15.666667  12.166667
std    14.706008  11.865918  14.719601  13.934370
min     5.000000   0.000000   1.000000   0.000000
25%    13.000000  12.000000   6.250000   0.750000
50%    23.500000  18.000000  12.500000   9.000000
75%    31.000000  27.750000  19.500000  18.750000
max    45.000000  31.000000  42.000000  35.000000

In [76]:
print(type[df7['POO']])
df7['POO']

type[enero    20
feb      35
marzo     3
abril    15
may       0
junio     0
Name: POO, dtype: int64]

enero    20
feb      35
marzo     3
abril    15
may       0
junio     0
Name: POO, dtype: int64

In [78]:
# Visualizacion de datos de solo un fragmento de nuestro DataFrame
df7['POO'].describe()

count     6.000000
mean     12.166667
std      13.934370
min       0.000000
25%       0.750000
50%       9.000000
75%      18.750000
max      35.000000
Name: POO, dtype: float64

In [79]:
sPOO=df7['POO']
sPOO

enero    20
feb      35
marzo     3
abril    15
may       0
junio     0
Name: POO, dtype: int64

In [91]:
#Visualizar un rango de indices (renglones)
df7[['POO', 'UML']]

       POO  UML
enero   20   15
feb     35    5
marzo    3    1
abril   15   10
may      0   42
junio    0   21

In [83]:
#nuevo DataFrame con solo dos columnas
dfPOO_UML= df7[['POO', 'UML']]
dfPOO_UML

       POO  UML
enero   20   15
feb     35    5
marzo    3    1
abril   15   10
may      0   42
junio    0   21

In [86]:
# Visualizar un rango de indices (renglones)
df7['marzo':'may']

       PROG1  TEBO  UML  POO
marzo     33    21    1    3
abril     45    30   10   15
may       25    31   42    0

In [92]:
#Solo visualizar dos columnas
df7['marzo':'may'][['POO', 'UML']]

       POO  UML
marzo    3    1
abril   15   10
may      0   42

In [95]:
df7[1:4]

       PROG1  TEBO  UML  POO
feb        5    15    5   35
marzo     33    21    1    3
abril     45    30   10   15

In [97]:
# Visualizar un rango de indices (renglones) de 2 en 2
df7[::2]

       PROG1  TEBO  UML  POO
enero     10     0   15   20
marzo     33    21    1    3
may       25    31   42    0

In [101]:
df7['PROG1'][::2]

enero    10
marzo    33
may      25
Name: PROG1, dtype: int64

In [107]:
from datetime import datetime
df = pd.DataFrame({'nombres':('Juan P√©rez',
                                 'Mar√≠a S√°nchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Mart√≠nez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})
df

            nombres     fechas    saldo  al_corriente
0        Juan P√©rez 1995-12-21   2500.0          True
1     Mar√≠a S√°nchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Mart√≠nez 1993-07-08  11323.2          True

In [109]:
# Obtener el tipo de dato de cada columna
df.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
dtype: object

In [112]:
# Solo obtener las metricas de todo lo que se puede contabilizar
df.describe()

             saldo
count      3.00000
mean    6389.40000
std     4503.36464
min     2500.00000
25%     3922.50000
50%     5345.00000
75%     8334.10000
max    11323.20000

In [114]:
# Es mejor el seleccionar una columna en especifico para obtener sus metricas
df['saldo'].describe()

count        3.00000
mean      6389.40000
std       4503.36464
min       2500.00000
25%       3922.50000
50%       5345.00000
75%       8334.10000
max      11323.20000
Name: saldo, dtype: float64

In [116]:
# En la visualizacion no lo cambia, mas bien solo combienrte los objetos a string
df.astype(str).dtypes

nombres         object
fechas          object
saldo           object
al_corriente    object
dtype: object

In [119]:
# no todos los objetos se pueden cambiar de valor
df['saldo'].astype(str)# Tratamos el saldo como una cadena, mas o lo CAMBIAMOS

0     2500.0
1     5345.0
2        nan
3    11323.2
Name: saldo, dtype: object

In [126]:
df['fechas'].astype("int64")

0    819504000000000000
1    600652800000000000
2    716428800000000000
3    742089600000000000
Name: fechas, dtype: int64

In [129]:
#Operaciones sobre nuestras columnas
df['saldo']*1.16

0     2900.000
1     6200.200
2          NaN
3    13134.912
Name: saldo, dtype: float64

In [132]:
# Cuando yo asigno valores a una nueva columna y no esta la crea
df['saldo_iva']=df['saldo']*1.16
df

            nombres     fechas    saldo  al_corriente  saldo_iva
0        Juan P√©rez 1995-12-21   2500.0          True   2900.000
1     Mar√≠a S√°nchez 1989-01-13   5345.0          True   6200.200
2      Jorge Vargas 1992-09-14      NaN         False        NaN
3  Rodrigo Mart√≠nez 1993-07-08  11323.2          True  13134.912

In [135]:
df.dtypes

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
saldo_iva              float64
dtype: object

In [138]:
df['saldo_iva']= df['saldo_iva'].astype(str)
df.dtypes
# Saldo_iva ya no es un float, ahora es un string por nuestra conversion

nombres                 object
fechas          datetime64[ns]
saldo                  float64
al_corriente              bool
saldo_iva               object
dtype: object

In [140]:
df['saldo_iva']*12
# Genera una iteraccion en la cadena

0    2900.02900.02900.02900.02900.02900.02900.02900...
1    6200.26200.26200.26200.26200.26200.26200.26200...
2                 nannannannannannannannannannannannan
3    13134.91213134.91213134.91213134.91213134.9121...
Name: saldo_iva, dtype: object

In [141]:
df['saldo']*12

0     30000.0
1     64140.0
2         NaN
3    135878.4
Name: saldo, dtype: float64